# General

tap 'homebrew/bundle'

# Casks

cask '1Password'

cask 'firefox'
cask 'signal'

cask 'visual-studio-code'
cask 'sourcetree'
cask 'iterm2'
cask 'maccy'
cask 'transmit'

cask 'sketch'
cask 'adapter'

cask 'docker'
cask 'postgres'

cask 'daisydisk'
cask 'the-unarchiver'
cask 'transmission'

cask 'spotify'
cask 'vlc'

# Brews

brew 'bash'
brew 'zsh'
brew 'zsh-completion'
brew 'fzf'

brew 'vim'

brew 'curl'
brew 'wget'
brew 'httpie'

brew 'coreutils'
brew 'openssl'

brew 'stow'
brew 'tree'
brew 'bat'
brew 'htop'

brew 'imagemagick'

brew 'git'
brew 'git-extras'

brew 'rbenv'
brew 'ruby-build'
brew 'yarn'